IlleniumDillon/MM32F5277/PinMap/MM32_ADC_PinMap.c
/*
 * @Author: IlleniumDillon 147900130@qq.com
 * @Date: 2023-03-05 19:44:57
 * @LastEditors: IlleniumDillon 147900130@qq.com
 * @LastEditTime: 2023-03-05 20:10:05
 * @FilePath: \buildd:\ARMFPGA\MM32F5277_Keil\PinMap\MM32_ADC_PinMap.c
 * @Description: 这是默认设置,请设置`customMade`, 打开koroFileHeader查看配置 进行设置: https://github.com/OBKoro1/koro1FileHeader/wiki/%E9%85%8D%E7%BD%AE
 */
#include "MM32_ADC_PinMap.h"

MM32_ADC_Pin ADC1_IN18_PF6  = {.periBase = ADC1, .port = GPIOF, .pin = P06, .chNum = 18};
MM32_ADC_Pin ADC1_IN17_PF7  = {.periBase = ADC1, .port = GPIOF, .pin = P07, .chNum = 17};
MM32_ADC_Pin ADC1_IN16_PF8  = {.periBase = ADC1, .port = GPIOF, .pin = P08, .chNum = 16};
MM32_ADC_Pin ADC1_IN15_PF9  = {.periBase = ADC1, .port = GPIOF, .pin = P09, .chNum = 15};
MM32_ADC_Pin ADC1_IN14_PF10 = {.periBase = ADC1, .port = GPIOF, .pin = P10, .chNum = 14};
MM32_ADC_Pin ADC1_IN10_PC0  = {.periBase = ADC1, .port = GPIOC, .pin = P00, .chNum = 10};
MM32_ADC_Pin ADC1_IN11_PC1  = {.periBase = ADC1, .port = GPIOC, .pin = P01, .chNum = 11};
MM32_ADC_Pin ADC1_IN12_PC2  = {.periBase = ADC1, .port = GPIOC, .pin = P02, .chNum = 12};
MM32_ADC_Pin ADC1_IN13_PC3  = {.periBase = ADC1, .port = GPIOC, .pin = P03, .chNum = 13};
MM32_ADC_Pin ADC1_IN0_PA0   = {.periBase = ADC1, .port = GPIOA, .pin = P00, .chNum = 0};
MM32_ADC_Pin ADC1_IN1_PA1   = {.periBase = ADC1, .port = GPIOA, .pin = P01, .chNum = 1};
MM32_ADC_Pin ADC1_IN2_PA2   = {.periBase = ADC1, .port = GPIOA, .pin = P02, .chNum = 2};
MM32_ADC_Pin ADC1_IN3_PA3   = {.periBase = ADC1, .port = GPIOA, .pin = P03, .chNum = 3};
MM32_ADC_Pin ADC1_IN4_PA4   = {.periBase = ADC1, .port = GPIOA, .pin = P04, .chNum = 4};
MM32_ADC_Pin ADC1_IN5_PA5   = {.periBase = ADC1, .port = GPIOA, .pin = P05, .chNum = 5};
MM32_ADC_Pin ADC1_IN6_PA6   = {.periBase = ADC1, .port = GPIOA, .pin = P06, .chNum = 6};
MM32_ADC_Pin ADC1_IN7_PA7   = {.periBase = ADC1, .port = GPIOA, .pin = P07, .chNum = 7};
MM32_ADC_Pin ADC1_IN8_PB0   = {.periBase = ADC1, .port = GPIOB, .pin = P00, .chNum = 8};
MM32_ADC_Pin ADC1_IN9_PB1   = {.periBase = ADC1, .port = GPIOB, .pin = P01, .chNum = 9};


MM32_ADC_Pin ADC2_IN10_PC0  = {.periBase = ADC2, .port = GPIOC, .pin = P00, .chNum = 10};
MM32_ADC_Pin ADC2_IN11_PC1  = {.periBase = ADC2, .port = GPIOC, .pin = P01, .chNum = 11};
MM32_ADC_Pin ADC2_IN0_PA0   = {.periBase = ADC2, .port = GPIOA, .pin = P00, .chNum = 0};
MM32_ADC_Pin ADC2_IN1_PA1   = {.periBase = ADC2, .port = GPIOA, .pin = P01, .chNum = 1};
MM32_ADC_Pin ADC2_IN2_PA2   = {.periBase = ADC2, .port = GPIOA, .pin = P02, .chNum = 2};
MM32_ADC_Pin ADC2_IN3_PA3   = {.periBase = ADC2, .port = GPIOA, .pin = P03, .chNum = 3};
MM32_ADC_Pin ADC2_IN4_PA4   = {.periBase = ADC2, .port = GPIOA, .pin = P04, .chNum = 4};
MM32_ADC_Pin ADC2_IN5_PA5   = {.periBase = ADC2, .port = GPIOA, .pin = P05, .chNum = 5};
MM32_ADC_Pin ADC2_IN6_PA6   = {.periBase = ADC2, .port = GPIOA, .pin = P06, .chNum = 6};
MM32_ADC_Pin ADC2_IN7_PA7   = {.periBase = ADC2, .port = GPIOA, .pin = P07, .chNum = 7};
MM32_ADC_Pin ADC2_IN14_PC4  = {.periBase = ADC2, .port = GPIOC, .pin = P04, .chNum = 14};
MM32_ADC_Pin ADC2_IN15_PC5  = {.periBase = ADC2, .port = GPIOC, .pin = P05, .chNum = 15};
MM32_ADC_Pin ADC2_IN8_PB0   = {.periBase = ADC2, .port = GPIOB, .pin = P00, .chNum = 8};
MM32_ADC_Pin ADC2_IN9_PB1   = {.periBase = ADC2, .port = GPIOB, .pin = P01, .chNum = 9};
MM32_ADC_Pin ADC2_IN12_PE7  = {.periBase = ADC2, .port = GPIOE, .pin = P07, .chNum = 12};
MM32_ADC_Pin ADC2_IN13_PE8  = {.periBase = ADC2, .port = GPIOE, .pin = P08, .chNum = 13};
MM32_ADC_Pin ADC2_IN16_PE9  = {.periBase = ADC2, .port = GPIOE, .pin = P09, .chNum = 16};
